var tableNnav = new Vue({
  el: '#vuetable',
  data: {
    cur: 1, // 当前页码
    tmpLimitLen: 4, // 每页显示数目
    columns: [{
      name: '班级名称'
    }, {
      name: '班级位置'
    }, {
      name: '班主任'
    }, {
      name: '学生总数'
    }, {
      name: '男生总数'
    }, {
      name: '女生总数'
    }],
    classes: [{
      班级名称: '七年级1班',
      班级位置: 'B栋301',
      班主任: '刘备',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级2班',
      班级位置: 'B栋302',
      班主任: '关羽',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级3班',
      班级位置: 'B栋303',
      班主任: '张飞',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级4班',
      班级位置: 'B栋304',
      班主任: '马超',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级5班',
      班级位置: 'B栋305',
      班主任: '赵云',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级6班',
      班级位置: 'B栋306',
      班主任: '刘备',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级7班',
      班级位置: 'B栋307',
      班主任: '关羽',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级8班',
      班级位置: 'B栋308',
      班主任: '张飞',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级9班',
      班级位置: 'B栋309',
      班主任: '马超',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级10班',
      班级位置: 'B栋310',
      班主任: '赵云',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级11班',
      班级位置: 'B栋311',
      班主任: '刘备',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级12班',
      班级位置: 'B栋312',
      班主任: '关羽',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级13班',
      班级位置: 'B栋313',
      班主任: '张飞',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级14班',
      班级位置: 'B栋314',
      班主任: '马超',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级15班',
      班级位置: 'B栋315',
      班主任: '赵云',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级16班',
      班级位置: 'B栋301',
      班主任: '刘备',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级17班',
      班级位置: 'B栋302',
      班主任: '关羽',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级18班',
      班级位置: 'B栋303',
      班主任: '张飞',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级19班',
      班级位置: 'B栋304',
      班主任: '马超',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级20班',
      班级位置: 'B栋305',
      班主任: '赵云',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级21班',
      班级位置: 'B栋301',
      班主任: '刘备',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级22班',
      班级位置: 'B栋302',
      班主任: '关羽',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级23班',
      班级位置: 'B栋303',
      班主任: '张飞',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级24班',
      班级位置: 'B栋304',
      班主任: '马超',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }, {
      班级名称: '七年级25班',
      班级位置: 'B栋305',
      班主任: '赵云',
      学生总数: '50',
      男生总数: '20',
      女生总数: '30'
    }]
  },
  // mounted () {
  //
  // },
  computed: {
    limitLen: function () {
      // 校验 视具体应用情况而定：
      // 由于一个函数只能一个return，所以就这样写：
      var result = 4
      if (this.tmpLimitLen < 1) {
        result = 1
      } else if (this.tmpLimitLen > 10) {
        result = 10
      } else {
        result = this.tmpLimitLen
      }
      return result
    },
    pageTotal: function () {
      return Math.ceil(this.classes.length / this.limitLen)
    },
    offset: function () {
      return (this.cur - 1) * this.limitLen
    },
    limitWithOffSet: function () {
      return this.classes.slice(this.offset, this.offset + this.limitLen)
    },
    indexs: function () {
      var firstIndex = 1
      var lastIndex = this.pageTotal
      var iArr = []

      var _cur = this.cur
      var _pageTotal = this.pageTotal
      if (_pageTotal > 10) {
        // 如果index总数超过10，
        // _cur1个+往前取4个数+往后取5个数 = 10个( 见最后else的代码)：
        if (_cur < 6) {
          // 而当_cur比较靠近1时：
          // firstIndex = 1
          lastIndex = 10
        } else if (_pageTotal - _cur < 6) {
          // 而当_cur比较靠近_pageTotal时：
          firstIndex = _pageTotal - 9
          // lastIndex = this.pageTotal
        } else {
          firstIndex = _cur - 4
          lastIndex = _cur + 5
        }
      }

      // 将处于firstIndex和lastIndex之间的整数都放入数组
      while (firstIndex <= lastIndex) {
        iArr.push(firstIndex)
        firstIndex++
      }
      return iArr
    }
  },
  methods: {
    pageTo: function (clickedIndex) { // 页码点击事件
      if (clickedIndex !== this.cur) {
        this.cur = clickedIndex
      }
    }
  }
})
/* title:vue-table
*  author: AlexZhong
* date: 2017-04-14
*/
